Wann-99/my-dev-lab/src/esp32_develop/esp32_camera_firmware/sdkconfig.defaults
# Core settings for ESP32-S3 N16R8
CONFIG_IDF_TARGET="esp32s3"

# Flash settings (16MB OPI)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_OPI=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM settings (8MB OPI)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_SPEED_80M=y

# Camera and Framebuffer optimization
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_MEMMAP_SMP=y

# USB Console and Debugging
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Power Stability Optimization
# Set brownout threshold to a lower level (approx 2.5V) to handle camera peak currents
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_0=y

CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_CAMERA_OV2640_SUPPORT=y
